---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveVisibilityParam
source: html/148ba99d-fb63-0f1c-3168-78bd35e7b3f1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveVisibilityParam Property

"Visibility/Graphics Overrides"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveVisibilityParam { get; }
```